List<Map> posts = [
  {
    'username': 'Abdallah',
    'text':
        'السلام عليكم ورحمة لله وبركاته، لدى هاتف أريد بيعه لأعلى سعر معالج ثمانى النواة وذاكرة داخلية 64 جيجا والرام 6 جيجا والكاميرا عالية الجودة 25 ميجا بيكسل',
  },
  {
    'username': 'Abuzead',
    'text':
        'السلام عليكم ورحمة لله وبركاته، لدى هاتف أريد بيعه لأعلى سعر معالج ثمانى النواة وذاكرة داخلية 64 جيجا والرام 6 جيجا والكاميرا عالية الجودة 25 ميجا بيكسل',
  },
  {
    'username': 'Omar',
    'text':
        'السلام عليكم ورحمة لله وبركاته، لدى هاتف أريد بيعه لأعلى سعر معالج ثمانى النواة وذاكرة داخلية 64 جيجا والرام 6 جيجا والكاميرا عالية الجودة 25 ميجا بيكسل',
  },
];
